<a href="https://colab.research.google.com/github/sera0911/asia-ai-study/blob/main/pandas_day1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

numpy_day1 정리
백터와 행렬을 사용하는 선형대수 계산에 주로 사용, 과학 계산을 위한 라이브러리 => numpy    
집합 자료형 => array(클래스타입 narray)   
array특성 => 모든 원소가 같은 자료형이여야 한다.   
arrya에 저장된 요소 접근 방식 => indexing   
array 생성 함수 => array(), zaros(), ones(), full(), eye(), arange()   
array객체의 속성 : ndim, shape, T   
array객체의 데이터 요소 접근 및 선택 방법 : [indexing] [array 객체]    
array객체의 연산은 빠른 성능 => 연속된 메모리에 데이터값을 할당, 내부 반복문을 사용해서 인덱스가 동일한 요소간의 연산수행 => 백터화 연산   
연산 대상 두 array객체의 크기가 동일하거나, 동일하지 않아도 백터화 연산 가능 => 작은 크기의 array의 요소를 반복, 확장시킴 (브로드캐스팅)    
array객체에 저장된 요소들을 연산처리 후 차원이 작은 array객체로 생성하는 연산함수 => all, any, argmax, argmin     
array객체의 데이터 요소를 행 단위, 열 단위로 연산함수를 적용하려면  axis=0(열), axis=1(행)  
array객체 크기를 변환 => reshape(d, r, c), -1, flatten   
2개의 array객체를 연결 => vstack(), hstack(), stack(), dstack()    
numpy.random.seed()    
numpy.random.rand()    
numpy.random.shuffle()    
numpy.random.choice(size, replace)   
numpy.random.randn(): 기댓값 0, 표준편차가 1이 되도록 정규분포를 따르는 난수 생성     
numpy.random.randint() : 균등분포 정수 난수 생성   
array 객체의 데이터 요소 중 중복되지 않는 유일값만 반환: unique(return_counts=True), bincount()     


데이터 수집, 전처리(필터, 그룹핑, 결측치처리, 변환), 데이터 분석에 사용되는 라이브러리   
pandas 자료형 - Series(value+index), 정수인덱스, 라벨인덱스, 1차원 numpy array와 유사   
               Dataframe(column(Series)+Row+index) - Column인덱스, RowIndex    
               정수인덱스 슬라이싱은 행인덱스로만 사용   

Series(value+index)는 파이썬 dict자료형처럼 사용 가능 - in, items(), indexs, values   
Series(value+index) 데이터 요소 삭제 del객체[인덱스]
 Nan이 아닌 값을 선택할 때 [객체.notnull()]

Ø 인덱서(indexer) 속성   
§ loc : 라벨값 기반의 2차원 인덱싱(로케이션)   
§ iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱(인덱스로케이션)   


loc - 인덱스 이름(index label), 범위 끝 포함 범위 지정 가능   
df.loc[행 인덱싱값]    
df.loc[행 인덱싱값, 열 인덱싱값]   
행 인덱싱값은 정수 또는 행 인덱스데이터이고 열 인덱싱값은 라벨 문자열이다.    
loc 인덱싱 값 - 인덱스데이터    
인덱스데이터 슬라이스    
인덱스데이터 리스트     
같은 행 인덱스를 가지는 불리언 시리즈 (행 인덱싱의 경우)     
또는 위의 값들을 반환하는 함수     
iloc - 정수형 위치 인덱스(integer position), 범위의 끝 제외 범위 지정 가능    


§ loc 인덱서를 사용하면서 인덱스를 하나만 넣으면 행(row)을 선택한다.
§ 인덱스를 가지는 불리언 시리즈도 행을 선택하는 인덱싱값으로 쓸 수 있다.

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.arange(10, 22).reshape(3, 4), index=["a", "b", "c"], columns=["A", "B", "C", "D"])
print(df)     #(10, 22)니까 10에서 21까지, 3행 4열, 

print(df.loc["a"])   #행인덱스 라벨로 지정 > 10, 11, 12, 13
print(df.loc["b":"c"]) #인덱스데이터의 슬라이스도 가능
print(df["b":"c"]) #loc를 쓰지 않는 경우에도 슬라이싱 가능
print(df.loc[["b", "c"]]) #인덱스데이터로 리스트도 가능
# df[["b", "c"]] # KeyError loc라는 인덱스 없이 그냥 리스트만 주면 키에러
print(df.A > 15)  #A열에서 15보다 큰 숫자만 트루로 출력 낮으면 폴스로 출력
print(df.loc[df.A > 15])  #데이터프레임에 loc라는 인덱싱속성

def select_rows(df):
  return df.A > 15     
print(select_rows(df))    ##인덱스 대신 인덱스 값을 반환하는 함수를 사용할 수도 있다.
print(df.loc[select_rows(df)])

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
A    10
B    11
C    12
D    13
Name: a, dtype: int64
    A   B   C   D
b  14  15  16  17
c  18  19  20  21
    A   B   C   D
b  14  15  16  17
c  18  19  20  21
    A   B   C   D
b  14  15  16  17
c  18  19  20  21
a    False
b    False
c     True
Name: A, dtype: bool
    A   B   C   D
c  18  19  20  21
a    False
b    False
c     True
Name: A, dtype: bool
    A   B   C   D
c  18  19  20  21

Ø 인덱서(indexer)    
§ loc 인덱서가 없는 경우에 사용했던 라벨 인덱싱이나 라벨 리스트 인덱싱은 불가능하다.     
§ 원래 (행) 인덱스값이 정수인 경우에는 슬라이싱도 라벨 슬라이싱 방식을 따르므로 슬라이스의 마지막 값이 포함된다.    

df.loc["a"] 행의 라벨 인덱스는 정상 실행
df.loc["A"] 열의 라벨 인덱스는 keyerror
df.loc["a", "b"] 행의 라벨 인덱스는 정상 실행
df.loc["A", "B"] 열의 라벨 인덱스는 keyerror

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.arange(10, 22).reshape(3, 4), index=["a", "b", "c"], columns=["A", "B", "C", "D"])
print(df)

# df.loc["A"] # KeyError
# df.loc[["A", "B"]] # KeyError

df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4), columns=["A", "B", "C", "D"])
print(df2)
print(df2.loc[1:2])   #1,2인덱싱 지정  정수 슬라이싱이여서 행 인덱싱

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25
    A   B   C   D
1  14  15  16  17
2  18  19  20  21

인덱싱   값                   가능   결과   자료형   추가사항           
행 인덱스값(정수)              O      행    Series
행 인덱스값(정수) 슬라이스     O      행 Dataframe     loc가 없는 경우와 같음       
행 인덱스값(정수) 리스트       O            Dataframe       
불리언 Series                  O     행     Dataframe     시리즈의 인덱스가 데이터프레임의 행 인덱스와 같아야 한다.      
불리언 Series를 반환하는 함수  O     행    Dataframe       
열 라벨                        X               loc가 없는 경우에만 쓸 수 있다.     
열 라벨 리스트                 X              loc가 없는 경우에만 쓸 수 있다.

Ø 인덱서(indexer)    
§ 인덱싱값을 행과 열 모두 받으려면 df.loc[행 인덱스, 열 인덱스]와 같은 형태로 사용    
§ 행과 열 모두 받는 인덱싱값으로 라벨 데이터의 슬라이싱 또는 리스트를 사용할 수도 있다.

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4), index=["a", "b", "c"], columns=["A", "B", "C", "D"])

print(df.loc["a", "A"])   #a 행인덱스 A열인덱스
print( df.loc["b":, "A"]) #b행인덱스 A열인덱스
print( df.loc["a", :])  #a행인덱스, :전체를지정
print( df.loc[["a", "b"], ["B", "D"]])
print( df.loc[df.A > 10, ["C", "D"]]) #불리형 값

10
b    14
c    18
Name: A, dtype: int64
A    10
B    11
C    12
D    13
Name: a, dtype: int64
    B   D
a  11  13
b  15  17
    C   D
b  16  17
c  20  21

Ø 인덱서(indexer)    
§ iloc 인덱서는 라벨이 아니라 순서를 나타내는 정수(integer) 인덱스만 받는다.    
§ 인덱스가 하나만 들어가면 행을 선택한다.

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
index=["a", "b", "c"],
columns=["A", "B", "C", "D"])

print(df.iloc[0, 1])  #0행1열 >11
print(df.iloc[:2, 2]) #0, 1행에 2열 >12, 16
print(df.iloc[0, -2:])  #-1, -2열에 0행 > 12,13
print(df.iloc[2:3, 1:3]) #2행 1,2열 >  19, 20
print(df.iloc[-1])   #인덱스가 하나라 행을 지정, -1은 끝에 행> 18. 19.20. 21
df.iloc[-1] = df.iloc[-1] * 2  #요소값을 변경 끝에 행을 2배로 늘림(위에는 추출만 이건 변경까지) 
print(df)

11
a    12
b    16
Name: C, dtype: int64
C    12
D    13
Name: a, dtype: int64
    B   C
c  19  20
A    18
B    19
C    20
D    21
Name: c, dtype: int64
    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

Ø Dataframe 데이터 조작    
§ count () - 데이터 갯수 세기, NaN 값은 세지 않는다    
§ Dataframe에서는 각 열마다 별도로 데이터 갯수를 센다. (데이터에서 값이 누락된 부분을 찾을 때 유용)     
§ value_counts() - Series의 값이 정수, 문자열, 카테고리 값인 경우 각각의 값이 나온 횟수를 셀 수 있다.   
§ 데이터프레임에는 value_counts 메서드가 없으므로 각 열마다 별도로 적용해야 한다.

In [ ]:
import pandas as pd
import numpy as np

s = pd.Series(range(10))
s[3] = np.nan
print(s)
print(s.count())  #NaN을 빼고 세서 번 [3]이 nan이니까

np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan   #[2,3]> 3행4열을 nan으로
print(df)
print(df.count())  #위에 [2, 3]이 난이니까 3열은 3개(열마다 셈)

s2 = pd.Series(np.random.randint(6, size=100))  #균등분포로 나오는지 확인 
print(s2.value_counts())    #value_counts = 유니크한 값이 몇 번이 나오는지 확인
print(df[0].value_counts())   #0하나만 지정했으니 행

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64
9
     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0
0    4
1    4
2    4
3    3
dtype: int64
2    22
0    18
3    17
5    15
1    15
4    13
dtype: int64
3.0    2
4.0    1
0.0    1
Name: 0, dtype: int64

Ø Dataframe 데이터 정렬    
§ sort_index() - 인덱스 값을 기준으로 정렬한다.    
§ sort_values() - 메서드는 데이터 값을 기준으로 정렬한다.    
§ NaN값이 있는 경우에는 정렬하면 NaN값이 가장 마지막에 위치한다.    
§ 큰 수에서 작은 수로 반대 방향 정렬하려면 ascending=False 인수를 지정한다.    
§ sort_values 메서드의 by 인수는 정렬 기준이 되는 열을 지정 한다.    
§ by 인수에 리스트 값을 넣으면 리스트의 첫번째 열을 기준으로 정렬한 후 동일한 값이 나오면 그 다음 열의 순서대로 정렬 된다.

In [ ]:
import pandas as pd
import numpy as np

s2 = pd.Series(np.random.randint(6, size=100))
print(s2.value_counts().sort_index())   #0~5까지 순차적으로 정렬해서 보여줌

print(s.sort_values())  #값 기준으로 정렬
print(s.sort_values(ascending=False))   #원래 어센딩은 오름차순인데, 폴스로 해서 내림차순으로

print(df.sort_values(by=3))   # by=3이기에 3열을 기준으로 정렬(2, 1, nan, 2 > 1, 2, 2, nan순으로 정렬됨)
print(df.sort_values(by=[1, 2]))   #리스트의 1열을 기준으로 정렬 후 동일 값이 나오면 2열이 순서대로 정렬되는데 이때 행까지 바꿔서 정렬됨

0    13
1    20
2    18
3    17
4    15
5    17
dtype: int64
0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64
9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64
     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
3  4.0  3.0  4.0  2.0
2  3.0  2.0  4.0  NaN
     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

Ø Dataframe 행/열 합계    
§ sum(axis) - axis 인수에는 합계로 인해 없어지는 방향축을 지정한다.        
§ axis인수의 디폴트 값이 0이므로 axis인수를 생략할 수 있다.    
§ mean 메서드는 평균을 구하며 sum 메서드와 사용법이 동일하다

In [ ]:
import pandas as pd
import numpy as np

np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
print(df2)
print(df2.sum(axis=1))    # 1이라서 행기준  
df2["RowSum"] = df2.sum(axis=1)  #1이라서 행기준
print(df2) 
print(df2.sum())   #아무것도 지정되지 않아 열기준
df2.loc["ColTotal", :] = df2.sum()
print(df2)

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1
0    35
1    34
2    41
3    42
dtype: int64
   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42
0          24
1          33
2          25
3          24
4          15
5          10
6           5
7          16
RowSum    152
dtype: int64
             0     1     2     3     4     5    6     7  RowSum
0          5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0    35.0
1          6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0    34.0
2          4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0    41.0
3          9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0    42.0
ColTotal  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0   152.0

Ø Dataframe 행이나 열 단위 복잡한 연산 처리    
§ apply() - 인수로 행 또는 열을 받는 함수를 전달하면 각 열(또는 행) 데이터에 함수를 반복 적용시킨다.     
§ 행에 대해 적용하고 싶으면 axis=1 인수를 전달한다    
§ 각 열에 대해 어떤 값이 얼마나 사용되었는지 알고 싶다면 value_counts 함수를 사용한다

In [ ]:
import pandas as pd

df3 = pd.DataFrame({
'A': [1, 3, 4, 3, 4],
'B': [2, 3, 1, 2, 3],
'C': [1, 5, 2, 4, 4]
})
print(df3)
print(df3.apply(lambda x: x.max() - x.min()))  #최댓값 4에서 최솟값 1빼면 3 이런식으로 각 A,B,C에서 함수를 인수로 전달받아서 행,열단위로 적용
print(df3.apply(lambda x: x.max() - x.min(), axis=1))  #axis 1이니까 행단위로 받아 위와같이 최대-최소빼기
print(df3.apply(pd.value_counts))

# 타이타닉호의 승객 중 나이 20살을 기준으로 성인(adult)과 미성년자(child)를 구별하는 라벨 열 만들기
import seaborn as sns    #seaborn라이브러리에서 타이타닉데이타를 제공해줌
titanic = sns.load_dataset("titanic")
titanic["adult/child"] = titanic.apply(lambda r: "adult" if r.age >= 20 else "child", axis=1)
#titanic["adult/child"] =새로운 값을 추가한 것 axis= 1이니 행으로
print(titanic.tail())

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4
A    3
B    2
C    4
dtype: int64
0    1
1    2
2    3
3    2
4    1
dtype: int64
     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0
     survived  pclass     sex   age  ...  embark_town  alive  alone adult/child
886         0       2    male  27.0  ...  Southampton     no   True       adult
887         1       1  female  19.0  ...  Southampton    yes   True       child
888         0       3  female   NaN  ...  Southampton     no  False       child
889         1       1    male  26.0  ...    Cherbourg    yes   True       adult
890         0       3    male  32.0  ...   Queenstown     no   True       adult

[5 rows x 16 columns]

In [ ]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset("titanic")

#(1)
print(titanic.count())

#(2)
print(titanic["sex"].sort_values().value_counts())
print(titanic["age"].sort_values().value_counts())
print(titanic["pclass"].sort_values().value_counts())
print(titanic["alive"].sort_values().value_counts())

#(3)
print(titanic["age"].mean())
#(4)
print(titanic.loc[titanic["sex"]=="female", "age"].mean())

#(5)
#ff = titanic.groupby(["sex","class"]).age.mean()
#print(ff["female","First"].roud(2)

#(6)

titanic["category1"] = titanic.apply(lambda r:"sex" if r.age >= 20 else "child", axis=1)
print(titanic)

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64
male      577
female    314
Name: sex, dtype: int64
24.00    30
22.00    27
18.00    26
28.00    25
30.00    25
         ..
70.50     1
20.50     1
34.50     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64
3    491
1    216
2    184
Name: pclass, dtype: int64
no     549
yes    342
Name: alive, dtype: int64
29.69911764705882
27.915708812260537
     survived  pclass     sex   age  ...  embark_town  alive  alone category1
0           0       3    male  22.0  ...  Southampton     no  False       sex
1           1       1  female  38.0  ...    Cherbourg    yes  False       sex
2           1       3  female  26.0  ...  Southampton    yes   True       sex
3           1       1  female  35.0  ...  Southampton    yes  False       sex
4           0       3    male  35.0  ...  Southampton     no   True       sex
..        ...     ...     ...   ...  ...          ...    ...    ...       ...
886         0       2    male  27.0  ...  Southampton     no   True       sex
887         1       1  female  19.0  ...  Southampton    yes   True     child
888         0       3  female   NaN  ...  Southampton     no  False     child
889         1       1    male  26.0  ...    Cherbourg    yes   True       sex
890         0       3    male  32.0  ...   Queenstown     no   True       sex

[891 rows x 16 columns]

(1) 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.     
(2) sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.     
(3) 타이타닉호 승객의 평균 나이를 구하라.    
(4) 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.     
(5) 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.    
(6) 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라.    
20살이 넘으면 성별을 그대로 사용한다.     
20살 미만이면 성별에 관계없이 “child”라고 한다.

In [ ]:
import pandas as pd

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡","향단", "방자"]
df = pd.DataFrame(data, index= index, columns=columns)

#(1)
s = pd.Series([90, 60, 80, 70], index = ["춘향", "몽룡","향단", "방자"])
print(s)

#(2)
df = pd.DataFrame(data, index= index, columns=columns)
print(df[["국어", "영어"]])

#(3)
df.loc["평균", :] = df.mean()
print(df)

#(4)
df.iloc[3, 1] = 80
df.loc["평균", :] = df.mean()
print(df)

#(5)
data2 =data = {
    "국어": [80],
    "영어": [90],
    "수학": [90],
}
columns = ["국어", "영어", "수학"]
index = ["춘향"]
df2 = pd.DataFrame(data2, index = index, columns=columns)
print(df2)

#(6)
s = pd.Series([70, 60, 80],
index=["국어", "영어", "수학"])
s.index.name = "향단"
print( s )

춘향    90
몽룡    60
향단    80
방자    70
dtype: int64
    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40
      국어    영어    수학
춘향  80.0  90.0  90.0
몽룡  90.0  70.0  60.0
향단  70.0  60.0  80.0
방자  30.0  40.0  70.0
평균  67.5  65.0  75.0
      국어    영어    수학
춘향  80.0  90.0  90.0
몽룡  90.0  70.0  60.0
향단  70.0  60.0  80.0
방자  30.0  80.0  70.0
평균  67.5  73.0  75.0
    국어  영어  수학
춘향  80  90  90
향단
국어    70
영어    60
수학    80
dtype: int64

연습문제    

(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.    
(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.    
(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.    
(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.     
(5) 춘향의 점수를 데이터프레임으로 나타낸다.    
(6) 향단의 점수를 시리즈로 나타낸다.

Ø Dataframe 행이나 열 단위 복잡한 연산 처리   
§ fillna() - NaN 값을 원하는 값으로 바꿀 수 있다.   
§ astype() - 전체 데이터의 자료형을 변경 할 수 있다   
§ cut () - 실수 값을 크기 기준으로 하여 카테고리 값으로 변환 , 실수 값의 경계선을 지정하는 경우, bins 인수는 카테고리를 나누는 기준값이 된다. 영역을 넘는 값은 NaN으로 처리된다.

In [ ]:
import pandas as pd

df3 = pd.DataFrame({ 'A': [1, 3, 4, 3, 4], 'B': [2, 3, 1, 2, 3], 'C': [1, 5, 2, 4, 4] })
print(df3.apply(pd.value_counts).fillna(0.0))   #value_counts후에 nan값을 0.0으로 지정해서 변환
print(df3.apply(pd.value_counts).fillna(0).astype(int))  #nan값을 0으로 변경 후 전체를 int로 자료형 변경

ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)  #구간값이 bins로 지정
print(cats)   #범위를 넘어가는 값은 nan으로 처리 0, 101>nan

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0
   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1
[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

Ø Dataframe 행이나 열 단위 복잡한 연산 처리   
§ cut 명령이 반환하는 값은 Categorical 클래스 객체   
§ Categorical 클래스 객체는 categories 속성으로 라벨 문자열을, codes 속성으로 정수로 인코딩한 카테고리 값을 가진다.    
§ 실수 값을 크기 기준으로 하여 카테고리 값으로 변환 qcut 명령은 구간 경계선을 지정하지 않고 데이터 갯수가 같도록 지정한 수의 구간으로 나눈다.

In [ ]:
import pandas as pd
import numpy as np

print(type(cats))
print(cats.categories)  #categories는 속성으로 라벨 문자열
print(cats.codes)  #codes는 속성으로 정수를 인코딩한 카테고리 값

df4 = pd.DataFrame(ages, columns=["ages"])
df4["age_cat"] = pd.cut(df4.ages, bins, labels=labels)
print(df4)
print(df4.age_cat.astype(str) + df4.ages.astype(str))

data = np.random.randn(1000)   #randn >정규분포를 따르는 실수인 난수 생성
#1000개의 데이터를 4개의 구간으로 나누는데 각 구간은 250개씩의 데이터를 가진다.
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])  #4는 구간수
print(cats)  
print(pd.value_counts(cats))
print(cats)

<class 'pandas.core.arrays.categorical.Categorical'>
Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')
[-1  0  0  1  1  2  2  3  0  2  2 -1]
    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11   101     NaN
0       nan0
1      미성년자2
2     미성년자10
3       청년21
4       청년23
5       중년37
6       중년31
7       장년61
8     미성년자20
9       중년41
10      중년32
11    nan101
dtype: object
['Q2', 'Q1', 'Q2', 'Q3', 'Q1', ..., 'Q1', 'Q1', 'Q4', 'Q4', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']
Q4    250
Q3    250
Q2    250
Q1    250
dtype: int64
['Q2', 'Q1', 'Q2', 'Q3', 'Q1', ..., 'Q1', 'Q1', 'Q4', 'Q4', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

Ø Dataframe 인덱스 설정 및 제거    
§ set_index : 기존의 행 인덱스를 제거하고 데이터 열 중 하나를 인덱스로 설정    
§ reset_index : 기존의 행 인덱스를 제거하고 인덱스를 데이터 열로 추가

In [ ]:
import pandas as pd

np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
np.round(np.random.rand(3, 5), 2)]).T,
columns=["C1", "C2", "C3", "C4"])   # 3행 5열, 소수점2째자리까지 생성되는 데이터 프레임에 T를 해서 ABCDE를 행으로 지정 후 vstack처리
print(df1)

df2 = df1.set_index("C1")   #기존 행 인덱스가 사라지고 C1을 인덱스로 설정한 것
print(df2)
df3 = df2.set_index("C2")  #기존 행 인덱스를 없애고 (df2니까 'ABCED'가 행인덱스), C2를 인덱스로 설정
print(df2)
print(df3)
df4 = df2.reset_index()
print(df4)

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07
      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07
      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07
        C3    C4
C2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07
  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

Ø Dataframe 다중 인덱스(multi-index) 설정    
§ 다중 인덱스(multi-index) - 행이나 열에 여러 계층을 가지는 인덱스    
§ 데이터프레임을 생성할 때 columns 인수에 리스트의 리스트(행렬) 형태로 인덱스를 넣으면 다중 열 인덱스를 가지게 된다.    
§ 다중 인덱스는 이름을 지정하면 더 편리하게 사용할 수 있다. 열 인덱스들의 이름 지정은 columns 객체의 names 속성에 리스트를 넣어서 지정한다.    
§ 데이터프레임을 생성할 때 index 인수에 리스트의 리스트(행렬) 형태로 인덱스를 넣으면 다중 (행) 인덱스를 가진다. 행 인덱스들의 이름 지정은 index 객체의 names 속성에 리스트를 넣어서 지정한다.

In [ ]:
import pandas as pd

np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
columns=[["A", "A", "B", "B"], ["C1", "C2", "C1", "C2"]])   #2차원리스트를 넘겨서 다중인덱스를 만듬

print(df3)
df3.columns.names = ["Cidx1", "Cidx2"]
print(df3)

df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
columns=[["A", "A", "B", "B"], ["C", "D", "C", "D"]],   #2차원리스트를 넘겨서 다중인덱스설정 
index=[["M", "M", "M", "F", "F", "F"], ["id_" + str(i + 1) for i in range(3)] * 2]) 
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
print(df4)

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85
Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85
Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1  -2.55  0.65  0.86 -0.74
      id_2   2.27 -1.45  0.05 -0.19
      id_3   1.53  1.47  0.15  0.38
F     id_1  -0.89 -1.98 -0.35  0.16
      id_2   1.23  1.20 -0.39 -0.30
      id_3  -1.05 -1.42 -1.71  1.95

Ø Dataframe 행 인덱스와 열 인덱스 교환    
§ stack : 열 인덱스 -> 행 인덱스로 변환
열 인덱스가 반시계 방향으로 90도 회전한 것과 비슷한 모양이 된다.   
§ unstack : 행 인덱스 -> 열 인덱스로 변환
행 인덱스가 시계 방향으로 90도 회전한 것과 비슷하다.  
§ 인덱스를 지정할 때는 문자열 이름과 순서를 표시하는 숫자 인덱스를 모두 사용할 수 있다.

In [ ]:
import pandas as pd
import numpy as np

df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
columns=[["A", "A", "B", "B"], ["C", "D", "C", "D"]],
index=[["M", "M", "M", "F", "F", "F"], ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]

df=df4.stack("Cidx1")  #열인덱스 Cidx1을 행인덱스로 교환 > 그래서 행인덱스3번째에 존재 
print(df)
df= df4.stack(1)    #열이름이 아닌 순서 번호로 지정해도 가능
print(df)
df= df4.unstack("Ridx2") #행인덱스 Ridx2를 열인덱스로 교환>시계방향으로 들어가 열인덱스 3번째에 존재
print(df)
df4.unstack(0)  #행이름이 아닌 순서 번호로 지정해도 가능
print(df)

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A     -0.51 -0.44
            B     -1.25  0.78
      id_2  A     -1.61 -0.21
            B     -0.90  0.39
      id_3  A     -0.51 -1.18
            B     -0.03  0.43
F     id_1  A      0.07  0.30
            B     -0.63 -0.36
      id_2  A     -0.67 -0.36
            B     -0.81 -1.73
      id_3  A      0.18 -0.40
            B     -1.63  0.46
Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C     -0.51 -1.25
            D     -0.44  0.78
      id_2  C     -1.61 -0.90
            D     -0.21  0.39
      id_3  C     -0.51 -0.03
            D     -1.18  0.43
F     id_1  C      0.07 -0.63
            D      0.30 -0.36
      id_2  C     -0.67 -0.81
            D     -0.36 -1.73
      id_3  C      0.18 -1.63
            D     -0.40  0.46
Cidx1     A                                   B
Cidx2     C                 D                 C                 D
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      0.07 -0.67  0.18  0.30 -0.36 -0.40 -0.63 -0.81 -1.63 -0.36 -1.73  0.46
M     -0.51 -1.61 -0.51 -0.44 -0.21 -1.18 -1.25 -0.90 -0.03  0.78  0.39  0.43
Cidx1     A                                   B
Cidx2     C                 D                 C                 D
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      0.07 -0.67  0.18  0.30 -0.36 -0.40 -0.63 -0.81 -1.63 -0.36 -1.73  0.46
M     -0.51 -1.61 -0.51 -0.44 -0.21 -1.18 -1.25 -0.90 -0.03  0.78  0.39  0.43

Ø Dataframe 다중 인덱스의 인덱싱    
§ 다중 인덱스를 가지는 경우에는 인덱스 값이 하나의 라벨이나 숫자가 아니라 ()로 둘러싸인 튜플이 되어야 한다 (튜플이 중요!)     
§ loc 인덱스를 사용하는 경우에도 튜플을 써야 한다.   
§ iloc 인덱서를 사용하는 경우에는 튜플 형태의 다중인덱스를 사용할 수 없다.    
§ 하나의 레벨 값만 넣으면 다중 인덱스 중에서 가장 상위의 값을 지정한 것으로 본다.

In [ ]:
import pandas as pd
import numpy as np

np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
columns=[["A", "A", "B", "B"], ["C1", "C2", "C1", "C2"]])
print(df3)

print(df3[("B", "C1")])   #B인덱스에서 C1을 꺼내기
print(df3.loc[0, ("B", "C1")])  # 0행에서 B와 C1 겹치는 건 0.98
df3.loc[0, ("B", "C1")] = 100   #iloc는 튜플을 써야 함 저 위치에 100을 넣는다는 뜻
print(df3)
print(df3['A'])
#print(df3['C1']) #KeyError C1이 두개라서 에러

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85
0    0.98
1    0.95
2    0.14
3    0.44
4    0.31
Name: (B, C1), dtype: float64
0.98
      A             B
     C1    C2      C1    C2
0  1.76  0.40  100.00  2.24
1  1.87 -0.98    0.95 -0.15
2 -0.10  0.41    0.14  1.45
3  0.76  0.12    0.44  0.33
4  1.49 -0.21    0.31 -0.85
     C1    C2
0  1.76  0.40
1  1.87 -0.98
2 -0.10  0.41
3  0.76  0.12
4  1.49 -0.21

Ø Dataframe 다중 인덱스의 인덱싱    
§ loc를 사용하는 경우에도 튜플이 아닌 하나의 값만 쓰면 가장 상위의 인덱스를 지정한 것과 같다.    
§ 특정 레벨의 모든 인덱스 값을 인덱싱할 때는 슬라이스를 사용한다.    
§ 다중 인덱스의 튜플 내에서는 : 슬라이스 기호를 사용할 수 없고 대신 slice(None) 값을 사용해야 한다.

In [ ]:
import pandas as pd
import numpy as np

df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
columns=[["A", "A", "B", "B"], ["C", "D", "C", "D"]],
index=[["M", "M", "M", "F", "F", "F"], ["id_" + str(i + 1) for i in range(3)] * 2])  #행인덱스
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]

print(df4.loc[("M", "id_1"), ("A", "C")]) #행에대한 멀티인덱서를 튜플로
print(df4.loc[:, ("A", "C")])   #행은 전체, 열은 AC
print(df4.loc[("M", "id_1"), :])  #행은 M,id1 열은슬라이싱
df4.loc[("All", "All"), :] = df4.sum() #행의 첫번째, 두번째인덱스이름이 ALL로 나와야함,그리고 각열의 합계를 함수로 반환
print(df4)
print(df4.loc["M"])  #M하나여서 상위인덱스
print(df4.loc[("M", slice(None)), :])  #슬라이스 값을 사용못해서 slice(None)을 사용해서 슬라이싱을 하는 것(그외의 값은 안뜸(none))
print(df4.loc[(slice(None), "id_1"), :])  #전체 중 id-1을 슬라이싱

-2.55
Ridx1  Ridx2
M      id_1    -2.55
       id_2     2.27
       id_3     1.53
F      id_1    -0.89
       id_2     1.23
       id_3    -1.05
Name: (A, C), dtype: float64
Cidx1  Cidx2
A      C       -2.55
       D        0.65
B      C        0.86
       D       -0.74
Name: (M, id_1), dtype: float64
Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1  -2.55  0.65  0.86 -0.74
      id_2   2.27 -1.45  0.05 -0.19
      id_3   1.53  1.47  0.15  0.38
F     id_1  -0.89 -1.98 -0.35  0.16
      id_2   1.23  1.20 -0.39 -0.30
      id_3  -1.05 -1.42 -1.71  1.95
All   All    0.54 -1.53 -1.39  1.26
Cidx1     A           B
Cidx2     C     D     C     D
Ridx2
id_1  -2.55  0.65  0.86 -0.74
id_2   2.27 -1.45  0.05 -0.19
id_3   1.53  1.47  0.15  0.38
Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1  -2.55  0.65  0.86 -0.74
      id_2   2.27 -1.45  0.05 -0.19
      id_3   1.53  1.47  0.15  0.38
Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1  -2.55  0.65  0.86 -0.74
F     id_1  -0.89 -1.98 -0.35  0.16

Ø Dataframe 다중 인덱스의 인덱스 순서 교환   
§ swaplevel(i, j, axis) - i와 j는 교환하고자 하는 인덱스 라벨(혹은 인덱스 번호)이고 axis는 0일 때 행 인덱스, 1일 때 열 인덱스를 의미한다. 디폴트는 행 인덱스이다.    
§ sort_index - 다중 인덱스가 있는 데이터프레임을 로 정렬, level 인수는 어떤 인덱스를 기준으로 정렬하는지 설정

In [ ]:
import pandas as pd
import numpy as np

df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
columns=[["A", "A", "B", "B"], ["C", "D", "C", "D"]],
index=[["M", "M", "M", "F", "F", "F"], ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]

df5 = df4.swaplevel("Ridx1", "Ridx2")  #이 두가지 순서를 서로 바꾼다는 뜻
print(df5)
df6 = df4.swaplevel("Cidx1", "Cidx2", 1) #axis를 1로해서 열에 있는 두가지 순서가 바뀐다느 듯
print(df6)

print(df5.sort_index(level=0))  #레벨이 0인 ID기준으로 정렬
print(df6.sort_index(axis=1, level=0))  #열에서 레벨이 0인 Cidx C D를 기준으로 정렬

Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
id_1  M     -0.51 -0.44 -1.25  0.78
id_2  M     -1.61 -0.21 -0.90  0.39
id_3  M     -0.51 -1.18 -0.03  0.43
id_1  F      0.07  0.30 -0.63 -0.36
id_2  F     -0.67 -0.36 -0.81 -1.73
id_3  F      0.18 -0.40 -1.63  0.46
Cidx2           C     D     C     D
Cidx1           A     A     B     B
Ridx1 Ridx2
M     id_1  -0.51 -0.44 -1.25  0.78
      id_2  -1.61 -0.21 -0.90  0.39
      id_3  -0.51 -1.18 -0.03  0.43
F     id_1   0.07  0.30 -0.63 -0.36
      id_2  -0.67 -0.36 -0.81 -1.73
      id_3   0.18 -0.40 -1.63  0.46
Cidx1           A           B
Cidx2           C     D     C     D
Ridx2 Ridx1
id_1  F      0.07  0.30 -0.63 -0.36
      M     -0.51 -0.44 -1.25  0.78
id_2  F     -0.67 -0.36 -0.81 -1.73
      M     -1.61 -0.21 -0.90  0.39
id_3  F      0.18 -0.40 -1.63  0.46
      M     -0.51 -1.18 -0.03  0.43
Cidx2           C           D
Cidx1           A     B     A     B
Ridx1 Ridx2
M     id_1  -0.51 -1.25 -0.44  0.78
      id_2  -1.61 -0.90 -0.21  0.39
      id_3  -0.51 -0.03 -1.18  0.43
F     id_1   0.07 -0.63  0.30 -0.36
      id_2  -0.67 -0.81 -0.36 -1.73
      id_3   0.18 -1.63 -0.40  0.46

Ø Dataframe 데이터 병합(merge), 연결(concatenate)   
§ merge() - 두 데이터 프레임의 공통 열 혹은 인덱스를 기준으로 두 개의 테이블을 합친다.    
기준이 되는 열, 행의 데이터를 키(key)라고 한다   
§ 기본적으로는 양쪽 데이터프레임에 모두 키가 존재하는 데이터만 보여주는 inner join 방식을 사용한다    
§ outer join 방식은 키 값이 한쪽에만 있어도 데이터를 보여준다    
§ left, right 방식은 각각 첫번째, 혹은 두번째 데이터프레임의 키 값을 모두 보여준다.

In [ ]:
import pandas as pd

df1 = pd.DataFrame({ '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
'이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
print(df1)

df2 = pd.DataFrame({ '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
'금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
print(df2)


print(pd.merge(df1, df2))  #같은 키가 존재하면 두 개의 테이블을 합침(공통값만 보여줌)inner join방식
print(pd.merge(df1, df2, how='outer'))  #how는 옵션 outer는 키가 한쪽만 있어도 다 보여줌(키가 기준으라 1001이 3개 총10개)
print(pd.merge(df1, df2, how='left'))   #left 는 왼쪽데이터 기준으로 키값을 보여준다(1008은 왼쪽키에 없으니제외)
print(pd.merge(df1, df2, how='right'))  #rihgt는 오른쪽데이터 기준으로 키값을 보여줌(1002,1003,1004,1007이 제외)

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희
   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000
   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000
   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0
   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN
   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1001   둘리   30000
3  1005   희동   15000
4  1006  마이콜    5000
5  1008  NaN  100000

Ø Dataframe 데이터 병합(merge), 연결(concatenate)   
§ 테이블에 키 값이 같은 데이터가 여러개 있는 경우에는 있을 수 있는 모든 경우의 수를 따져서 조합을 만들어 낸다.   
§ 두 데이터프레임에서 이름이 같은 열은 모두 키가 된다.   
§ 이름이 같아도 키가 되면 안되는 열이 있다면 on 인수로 기준열을 명시해야 한다.    
§ 기준 열이 아니면서 이름이 같은 열에는 _x 또는 _y 와 같은 접미사가 붙는다.

In [ ]:
import pandas as pd

df1 = pd.DataFrame({
'품종': ['setosa', 'setosa', 'virginica', 'virginica'],
'꽃잎길이': [1.4, 1.3, 1.5, 1.3]},
columns=['품종', '꽃잎길이'])
print(df1)

df2 = pd.DataFrame({
'품종': ['setosa', 'virginica', 'virginica', 'versicolor'],
'꽃잎너비': [0.4, 0.3, 0.5, 0.3]},
columns=['품종', '꽃잎너비'])
print(df2)
print(pd.merge(df1, df2)) #inner join방식 versicolor이건 두가지엔 해당 사항이 없어서 제외됨

          품종  꽃잎길이
0     setosa   1.4
1     setosa   1.3
2  virginica   1.5
3  virginica   1.3
           품종  꽃잎너비
0      setosa   0.4
1   virginica   0.3
2   virginica   0.5
3  versicolor   0.3
          품종  꽃잎길이  꽃잎너비
0     setosa   1.4   0.4
1     setosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

In [ ]:
import pandas as pd

df1 = pd.DataFrame({
'고객명': ['춘향', '춘향', '몽룡'],
'날짜': ['2018-01-01', '2018-01-02', '2018-01-01'],
'데이터': ['20000', '30000', '100000']})
print(df1)

df2 = pd.DataFrame({
'고객명': ['춘향', '몽룡'],
'데이터': ['여자', '남자']})
print(df2)
print(pd.merge(df1, df2, on='고객명'))  #데이터값이 불일치해서 이런경우는 on을써서 고객명으로만 join함

  고객명          날짜     데이터
0  춘향  2018-01-01   20000
1  춘향  2018-01-02   30000
2  몽룡  2018-01-01  100000
  고객명 데이터
0  춘향  여자
1  몽룡  남자
  고객명          날짜   데이터_x 데이터_y
0  춘향  2018-01-01   20000    여자
1  춘향  2018-01-02   30000    여자
2  몽룡  2018-01-01  100000    남자

고객명          날짜   데이터_x 데이터_y    
이 결과는 기준열이 아니면서 이름이 같은 열은 뒤에 접미사가 붙게됨

Ø Dataframe 데이터 병합(merge), 연결(concatenate)   
§ 키가 되는 기준열의 이름이 두 데이터프레임에서 다르다면 left_on, right_on 인수를 사용하여 기준열을 명시해야 한다.   
§ 일반 데이터 열이 아닌 인덱스를 기준열로 사용하려면 left_index 또는 right_index 인수를 True 로 설정한다.

In [ ]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({ '이름': ['영희', '철수', '철수'], '성적': [1, 2, 3]} )
print(df1)
df2 = pd.DataFrame({ '성명': ['영희', '영희', '철수'], '성적2': [4, 5, 6]} )  
print(df2)
print(pd.merge(df1, df2, left_on='이름', right_on="성명"))  #df1에서 기준 키는 이름으로, df2에서 기준키는 성명으로

df1 = pd.DataFrame({ '도시': ['서울', '서울', '서울', '부산', '부산'],
'연도': [2000, 2005, 2010, 2000, 2005],
'인구': [9853972, 9762546, 9631482, 3655437, 3512547]})
print(df1)

df2 = pd.DataFrame( np.arange(12).reshape((6, 2)),
index=[['부산', '부산', '서울', '서울', '서울', '서울'],
[2000, 2005, 2000, 2005, 2010, 2015]],
columns=['데이터1', '데이터2'])
print(df2)
print(pd.merge(df1, df2, left_on=['도시', '연도'], right_index=True))  #df1에서 기준은 도시와 연도라는 인덱스로, df2는 키로 행인덱스를 사용

   이름  성적
0  영희   1
1  철수   2
2  철수   3
   성명  성적2
0  영희    4
1  영희    5
2  철수    6
   이름  성적  성명  성적2
0  영희   1  영희    4
1  영희   1  영희    5
2  철수   2  철수    6
3  철수   3  철수    6
   도시    연도       인구
0  서울  2000  9853972
1  서울  2005  9762546
2  서울  2010  9631482
3  부산  2000  3655437
4  부산  2005  3512547
         데이터1  데이터2
부산 2000     0     1
   2005     2     3
서울 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11
   도시    연도       인구  데이터1  데이터2
0  서울  2000  9853972     4     5
1  서울  2005  9762546     6     7
2  서울  2010  9631482     8     9
3  부산  2000  3655437     0     1
4  부산  2005  3512547     2     3

§ merge 명령어 대신 join 메서드를 사용할 수도 있다.

In [ ]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame(
[[1., 2.], [3., 4.], [5., 6.]],
index=['a', 'c', 'e'],
columns=['서울', '부산'])
print(df1)

df2 = pd.DataFrame(
[[7., 8.], [9., 10.], [11., 12.], [13, 14]],
index=['b', 'c', 'd', 'e'],
columns=['대구', '광주'])
print(df2)

print(pd.merge(df1, df2, how='outer', left_index=True, right_index=True))  #true라서 둘 다 행인덱스 기준으로 하겠다는 것
print(df1.join(df2, how='outer'))   #merge는 판다스 join은 dataframe 둘 다 기능은 같음

    서울   부산
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0
     대구    광주
b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0
    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0
    서울   부산    대구    광주
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

Ø Dataframe 데이터 병합(merge), 연결(concatenate)   
§ concat 함수를 사용하면 기준 열(key column)을 사용하지 않고 단순히 데이터를 연결(concatenate)한다.   
§ 기본적으로는 위/아래로 데이터 행을 연결한다. 단순히 두 시리즈나 데이터프레임을 연결하기 때문에 인덱스 값이 중복될 수 있다.   
§ 데이터 열을 연결하고 싶으면 axis=1로 인수를 설정한다.

In [ ]:
import pandas as pd

s1 = pd.Series([0, 1], index=['A', 'B'])  #시리즈객체
s2 = pd.Series([2, 3, 4], index=['A', 'B', 'C'])
print(s1)
print(s2)
print(pd.concat([s1, s2]))  #어팬드방식으로 두 데이터를 합친 것 (axis =0이여서, 아래쪽으로 이어서)

df1 = pd.DataFrame( np.arange(6).reshape(3, 2), index=['a', 'b', 'c'], columns=['데이터1', '데이터2'])
print(df1)
df2 = pd.DataFrame( 5 + np.arange(4).reshape(2, 2), index=['a', 'c'], columns=['데이터3', '데이터4'])
print(df2)   #앞에 5는 나온수에 5를 더한다는 뜻
print(pd.concat([df1, df2], axis=1))  #axis가 1이기에 열으로 데이터 두 개가 어팬드 방식으로 이어짐

A    0
B    1
dtype: int64
A    2
B    3
C    4
dtype: int64
A    0
B    1
A    2
B    3
C    4
dtype: int64
   데이터1  데이터2
a     0     1
b     2     3
c     4     5
   데이터3  데이터4
a     5     6
c     7     8
   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

Ø Dataframe 피봇테이블(pivot table)    
§ 피봇테이블(pivot table)이란 데이터 열 중에서 두 개의 열을 각각 행 인덱스, 열 인덱스로 사용하여 데이터를 조회하여 펼쳐놓은 것    
§ pivot () - 피봇테이블 생성 메서드     
§ 첫번째 인수로는 행 인덱스로 사용할 열 이름, 두번째 인수로는 열 인덱스로 사용할 열 이름, 마지막으로 데이터로 사용할 열 이름을 넣는다.     
§ Pandas 지정된 두 열을 각각 행 인덱스와 열 인덱스로 바꾼 후 행 인덱스의 라벨 값이 첫번째 키의 값과 같고 열 인덱스의 라벨 값이 두번째 키의 값과 같은 데이터를 찾아서 해당 칸에 넣는다. 만약 주어진 데이터가 존재하지 않으면 해당 칸에 NaN 값을
넣는다.     
§ 피봇테이블은 set_index 명령과 unstack 명령을 사용해서 만들 수도 있다

In [ ]:
import pandas as pd
data = {
"도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
"연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
"인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
"지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
print(df1)

#행 인덱스 인수로는 "도시", 열 인덱스 인수로는 "연도", 데이터 이름으로 "인구"를 입력
print(df1.pivot("도시", "연도", "인구"))
#피봇테이블은 set_index 명령과 unstack 명령을 사용해서 만들 수도 있다.
print(df1.set_index(["도시", "연도"])[["인구"]].unstack())  #unstack은 열로 이동

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0
           인구
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

Ø Dataframe 피봇테이블(pivot table)    
§ 행 인덱스나 열 인덱스를 리스트로 주는 경우에는 다중 인덱스 피봇 테이블을 생성한다.    
§ 행 인덱스와 열 인덱스는 데이터를 찾는 키(key)의 역할을 한다. 따라서 키 값으로 데이터가 단 하나만 찾아져야 한다.    
§ 행 인덱스와 열 인덱스 조건을 만족하는 데이터가 2개 이상인 경우에는 에러가 발생한다.

In [ ]:
import pandas as pd
data = {
"도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
"연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
"인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
"지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
print(df1)
print(df1.pivot(["지역", "도시"], "연도", "인구"))  #행인덱스를 지역,도시 2개로 사용, 열인덱스는 연도, 데이터는 인구
try:
  df1.pivot("지역", "연도", "인구")  #도시는 문제가 안되지만 지역을 하면 겹쳐지는 내용이 나옴
except ValueError as e:    #교차되는 데이터가 2개이상이 나오기때문에 에러가 나옴
  print("ValueError:", e)

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권
연도           2005       2010       2015
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0
수도권 서울  9762546.0  9631482.0  9904312.0
    인천        NaN   263203.0  2890451.0
ValueError: Index contains duplicate entries, cannot reshape

Ø Dataframe 그룹분석    
§ groupby 메서드는 데이터를 그룹 별로 분류하는 역할을 한다.    
§ groupby 메서드의 인수 - 열 또는 열의 리스트 , 행 인덱스   
§ 연산 결과로 그룹 데이터를 나타내는 GroupBy 클래스 객체를 반환    
§ GroupBy 클래스 객체에는 그룹별로 연산을 할 수 있는 그룹연산 메서드가 있다.    
§ size, count: 그룹 데이터의 갯수  
§ mean, median, min, max: 그룹 데이터의 평균, 중앙값, 최소, 최대    
§ sum, prod, std, var, quantile : 그룹 데이터의 합계, 곱, 표준편차, 분산, 사분위수    
§ first, last : 그룹 데이터 중 가장 첫번째 데이터와 가장 나중 데이터   
§ agg , aggregate : 만약 원하는 그룹연산이 없는 경우 함수를 만들고 이 함수를 agg에 전달한다.    
§ 또는 여러가지 그룹연산을 동시에 하고 싶은 경우 함수 이름 문자열의 리스트를 전달한다.   
§ describe : 하나의 그룹 대표값이 아니라 여러개의 값을 데이터프레임으로 구한다.(데이터의 특성을 한번에 보게끔)     
§ apply : describe 처럼 하나의 대표값이 아닌 데이터프레임을 출력하지만 원하는 그룹연산이 없는 경우에 사용한다   
§ transform :그룹에 대한 대표값을 만드는 것이 아니라 그룹별 계산을 통해 데이터 자체를 변형한다.

Ø Dataframe 그룹분석    
§ count : 전체 성분의 (NaN이 아닌) 값의 갯수를 계산    
§ argmin, argmax : 전체 성분의 최솟값, 최댓값이 위치한 (정수)인덱스를 반환    
§ idxmin, idxmax : 전체 인덱스 중 최솟값, 최댓값을 반환    
§ quantile : 전체 성분의 특정 사분위수에 해당하는 값을 반환 (0~1 사이)    
§ mad : 전체 성분의 평균값으로부터의 절대 편차(absolute deviation)의 평균을 계산   
§ cumsum : 맨 첫 번째 성분부터 각 성분까지의 누적합을 계산 (0에서부터 계속 더해짐)    
§ cumprod : 맨 첫번째 성분부터 각 성분까지의 누적곱을 계산 (1에서부터 계속 곱해짐)    
§ info() : 데이터의 자료형과 개수를 확인    
§ dropna(subset=['컬럼명'], how='any', axis=0) > na값을 삭제시키는 것

In [ ]:
import pandas as pd

np.random.seed(0)
df2 = pd.DataFrame({
'key1': ['A', 'A', 'B', 'B', 'A'],
'key2': ['one', 'two', 'one', 'two', 'one'],
'data1': [1, 2, 3, 4, 5],
'data2': [10, 20, 30, 40, 50]
})
print(df2)

groups = df2.groupby(df2.key1) #그룹 A와 그룹 B로 구분 
print(groups)  #groupby클래스유형 (인덱스로)
print(groups.groups) #각 그룹 데이터의 인덱스를 저장한 groups 속성(A는 0,1,4, B는 2,3이런 식으로)
print(groups.sum()) #A그룹과 B그룹 데이터의 합계 (위 데이터의 합계)
print(df2.data1.groupby(df2.key1).sum())   #data1의 데이터를 A,B로 그룹바이를 한 뒤 데이터 합을 계산
print(df2.groupby(df2.key1)["data1"].sum()) # `GroupBy` 클래스 객체에서 data1만 선택하여 분석하는 경우
print(df2.groupby(df2.key1).sum()["data1"]) # 전체 데이터를 분석한 후 data1만 선택한 경우

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f2e5a1b5650>
{'A': [0, 1, 4], 'B': [2, 3]}
      data1  data2
key1
A         8     80
B         7     70
key1
A    8
B    7
Name: data1, dtype: int64
key1
A    8
B    7
Name: data1, dtype: int64
key1
A    8
B    7
Name: data1, dtype: int64

Ø Dataframe 그룹분석    
§ 분석하고자 하는 키가 복수이면 리스트를 사용한다.    
§ 그룹분석 결과를 unstack 명령으로 피봇 데이블 형태로 만들수도 있다.

In [ ]:
import pandas as pd

np.random.seed(0)
df2 = pd.DataFrame({
'key1': ['A', 'A', 'B', 'B', 'A'],
'key2': ['one', 'two', 'one', 'two', 'one'],
'data1': [1, 2, 3, 4, 5],
'data2': [10, 20, 30, 40, 50]
})

#복합 키 (key1, key2) 값에 따른 data1의 합계를 구하기
res = df2.data1.groupby([df2.key1, df2.key2]).sum()  #2개의 키값으로 그룹바이 A-one, A-two, B-one, B-two이런식으로 한 뒤 각 합
print(res)
res2 = df2.data1.groupby([df2["key1"], df2["key2"]]).sum().unstack("key2")
print(res2)
# 인구 데이터로부터 지역별 합계를 구하기
df1["인구"].groupby([df1["지역"], df1["연도"]]).sum().unstack("연도") #지역과 연도별로 그룹바이, 연도는 열로 unstack(열로 이동)

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64
key2  one  two
key1
A       6    2
B       3    4

연도      2005     2010      2015
지역
경상권  3512547  3393191   3448737
수도권  9762546  9894685  12794763

Ø Dataframe 그룹분석    
§ describe - 다양한 기술 통계(descriptive statistics)값을 그룹별로 하나의 스칼라 값이 아니라 하나의 데이터프레임으로 생성된다 (count, mean, std, min, quantil(25%), quantil(50%), quantil(75%), max)

In [ ]:
import seaborn as sns

iris = sns.load_dataset("iris")
#각 붓꽃 종별로 가장 큰 값과 가장 작은 값의 비율
def peak_to_peak_ratio(x):
  return x.max() / x.min()

a1 = iris.groupby(iris.species).agg(peak_to_peak_ratio)  #스피치 종류3종을 그룹바이
print(a1)
a2 = iris.groupby(iris.species).describe().T   #각 기술통계값을 생성함
print(a2)

#각 붓꽃 종별로 가장 꽃잎 길이(petal length)가 큰 3개의 데이터를 뽑아낼 수도 있다.
def top3_petal_length(df):
  return df.sort_values(by="petal_length", ascending=False)[:3]   
a3 = iris.groupby(iris.species).apply(top3_petal_length)
print(a3)

#각 붓꽃 꽃잎길이가 해당 종 내에서 대/중/소 어느 것에 해당되는지에 대한 데이터프레임 생성
def q3cut(s):
  return pd.qcut(s, 3, labels=["소", "중", "대"]).astype(str)   
a4 =iris["petal_length_class"] = iris.groupby(iris.species).petal_length.transform(q3cut)
print(a4)
a5= iris[["petal_length", "petal_length_class"]].tail(10)
print(a5)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714
species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000
                sepal_length  sepal_width  ...  petal_width     species
species                                    ...
setosa     24            4.8          3.4  ...          0.2      setosa
           44            5.1          3.8  ...          0.4      setosa
           23            5.1          3.3  ...          0.5      setosa
versicolor 83            6.0          2.7  ...          1.6  versicolor
           77            6.7          3.0  ...          1.7  versicolor
           72            6.3          2.5  ...          1.5  versicolor
virginica  118           7.7          2.6  ...          2.3   virginica
           117           7.7          3.8  ...          2.2   virginica
           122           7.7          2.8  ...          2.0   virginica

[9 rows x 5 columns]
0      소
1      소
2      소
3      중
4      소
      ..
145    소
146    소
147    소
148    중
149    소
Name: petal_length, Length: 150, dtype: object
     petal_length petal_length_class
140           5.6                  중
141           5.1                  소
142           5.1                  소
143           5.9                  대
144           5.7                  중
145           5.2                  소
146           5.0                  소
147           5.2                  소
148           5.4                  중
149           5.1                  소

Ø Pandas Dataframe    
§ rename() - 행 인덱스 또는 열 이름의 일부를 선택하여 변경할 수 있다 (원본 객체를 수정하는 것이 아니라 새로운 데이터 프레임 객체를 반환)     

행 인덱스 변경 : Dataframe 객체.rename(index={기존 인덱스: 새 인덱스, ….})     
열 이름 변경 : Dataframe 객체.rename(columns={기존 인덱스: 새 이름, ….})     

§ drop() – 데이터프레임의 행 또는 열을 삭제, 행삭제 axis=0 옵션, 열 삭제 axis=1 옵션    
§ 동시에 여러 개의 행 또는 열을 삭제하려면 리스트 형태로 입력     
§ drop()는 기존 객체를 변경하지 않고 새로운 객체를 반환하며, 원본 객체를 직접 변경하기 위해서는 inplace=True 옵션을 추가     


행 삭제 : Dataframe 객체.drop(행 인덱스 또는 배열, axis=0)    
열 삭제 : Dataframe 객체.drop(열 이름 또는 배열, axis=1)

In [ ]:
df = pd.DataFrame({"A":[1, 2, 3], "B": [4, 5, 6]})

df1 = df.rename(columns={"A": "a", "B":"b"})
df2 = df.rename(index={0:"x", 1:"y", 2:"z"})
print(df.index)
print(df.rename(index=str).index)

RangeIndex(start=0, stop=3, step=1)
Index(['0', '1', '2'], dtype='object')

In [ ]:
df = pd.DataFrame(np.arange(12).reshape(3, 4), columns=['A','B','C','D'])

df.drop(['B', 'C'], axis=1)
df.drop(columns=['B','C'])
print(df)
df.drop([0, 1])

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

   A  B   C   D
2  8  9  10  11

In [ ]:
midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
                             ['speed', 'weight', 'length']],
                     codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
                            [0, 1, 2, 0, 1, 2, 0, 1, 2]])

df = pd.DataFrame(index=midx, columns=['big', 'small'],
                  data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
                        [250, 150], [1.5, 0.8], [320, 250],
                        [1, 0.8], [0.3, 0.2]])

print(df)

df.drop(index='cow', columns='small')
df.drop(index='length', level=1)

                 big  small
lama   speed    45.0   30.0
       weight  200.0  100.0
       length    1.5    1.0
cow    speed    30.0   20.0
       weight  250.0  150.0
       length    1.5    0.8
falcon speed   320.0  250.0
       weight    1.0    0.8
       length    0.3    0.2

                 big  small
lama   speed    45.0   30.0
       weight  200.0  100.0
cow    speed    30.0   20.0
       weight  250.0  150.0
falcon speed   320.0  250.0
       weight    1.0    0.8

Ø Dataframe에 컬럼, 로우, 인덱스 추가하기    
§ append() - row를 추가    
§ reset index() - index를 0부터 새롭게 지정한다.

In [ ]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=[48, 49, 50]) 
display(df)

a = pd.DataFrame(data=[[1,2,3]], columns=[48,49,50])  
display(a)

df = df.append(a)  
df = df.reset_index(drop=True) #drop=true는 기존인덱스를 삭제하고 a를 새로 인덱스로 지정
display(df)

df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), columns=['A', 'B', 'C'])
display(df)

df.loc[:, 'D'] = pd.Series(['5', '6', '7'], index=df.index)  #index=df.index > 0, 1, 2(위와 동일한 인덱스 지정),, D열을 추가한 것
display(df)

df['E'] = pd.Series(['5', '6', '7'], index=df.index) #E열을 추가
display(df)

   48  49  50
0   1   2   3
1   4   5   6
2   7   8   9

   48  49  50
0   1   2   3

   48  49  50
0   1   2   3
1   4   5   6
2   7   8   9
3   1   2   3

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

   A  B  C  D
0  1  2  3  5
1  4  5  6  6
2  7  8  9  7

   A  B  C  D  E
0  1  2  3  5  5
1  4  5  6  6  6
2  7  8  9  7  7

Ø Dataframe에 컬럼, 로우, 인덱스 삭제하기   
§ drop_duplicate() - 특정 컬럼의 값이 중복된 로우를 제거  
§ keep 옵션 - 중복된 것들 중 어떤 걸 유지할지 지정.

In [ ]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [40, 50, 60], [23, 35, 37]]),
index= [2.5, 12.6, 4.8, 4.8, 2.5],
columns=[48, 49, 50])
display(df)

df = df.reset_index()   #인덱스 새로 지정
display(df)

df = df.drop_duplicates(subset='index', keep='last').set_index('index')  #인덱스를 기준으로 중복된 것 중에 나중(last)것을 지정
display(df)   #인덱스에서 2.5랑 4.8중복되어 지워짐 

df = pd.DataFrame(data=np.array([[1, 2, 3], [1, 5, 6], [7, 8, 9]]), columns=['A', 'B', 'C'])  #df에서 [1,2,3][7,8,9]는 중복되어서 사라짐
display(df)

print(df.index[1])
print(df.drop(df.index[1]))
print(df.drop(0))   #열을 삭제할 때 이렇게 지정

      48  49  50
2.5    1   2   3
12.6   4   5   6
4.8    7   8   9
4.8   40  50  60
2.5   23  35  37

   index  48  49  50
0    2.5   1   2   3
1   12.6   4   5   6
2    4.8   7   8   9
3    4.8  40  50  60
4    2.5  23  35  37

       48  49  50
index
12.6    4   5   6
4.8    40  50  60
2.5    23  35  37

   A  B  C
0  1  2  3
1  1  5  6
2  7  8  9

1
   A  B  C
0  1  2  3
2  7  8  9
   A  B  C
1  1  5  6
2  7  8  9

Ø pivot_table    
§ pivot_table - pivot 명령과 groupby 명령의 중간 성격을 가지는 명령    
groupby 명령의 결과에 unstack을 자동 적용하여 2차원적인 형태로 변형한다     
pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None,
margins=False, margins_name='All')    
data : 분석할 데이터프레임 (메서드일 때는 필요하지 않음)    
values : 분석할 데이터프레임에서 분석할 열    
index : 행 인덱스로 들어갈 키 열 또는 키 열의 리스트    
columns : 열 인덱스로 들어갈 키 열 또는 키 열의 리스트    
aggfunc : 분석 메서드    
fill_value : NaN 대체 값    
margins : 모든 데이터를 분석한 결과를 오른쪽과 아래에 붙일지 여부 True면 오른쪽 False면 아래쪽으로 나옴alues : 분석할 데이터프레임에서 분석할 열    
index : 행 인덱스로 들어갈 키 열 또는 키 열의 리스트    
columns : 열 인덱스로 들어갈 키 열 또는 키 열의 리스트    
aggfunc : 분석 메서드    
fill_value : NaN 대체 값    
margins : 모든 데이터를 분석한 결과를 오른쪽과 아래에 붙일지 여부 True면 오른쪽 False면 아래쪽으로 나옴   
   
margins_name : 마진 열(행)의 이름

In [ ]:
data = { "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
"연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
"인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
"지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"] }
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
print(df1.pivot_table("인구", "도시", "연도"))  #데이터, 행, 열 순서로 이루어짐!
print(df1.pivot_table("인구", "도시", "연도", margins=True, margins_name="합계")) #true니까 오른쪽으로 나옴
print(df1["인구"].mean())
print(df1.pivot_table("인구", index=["연도", "도시"]))  #연도와 도시가 행으로 가서 데이터는 인구데이터로

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0
연도       2005       2010       2015            합계
도시
부산  3512547.0  3393191.0  3448737.0  3.451492e+06
서울  9762546.0  9631482.0  9904312.0  9.766113e+06
인천        NaN   263203.0  2890451.0  1.576827e+06
합계  6637546.5  4429292.0  5414500.0  5.350809e+06
5350808.625
              인구
연도   도시
2005 부산  3512547
     서울  9762546
2010 부산  3393191
     서울  9631482
     인천   263203
2015 부산  3448737
     서울  9904312
     인천  2890451

Ø pivot_table 활용 예시   
§ 팁(tip)과 관련된 데이터    
§ total_bill: 식사대금    
§ tip: 팁    
§ sex: 성별    
§ smoker: 흡연/금연 여부    
§ day: 요일    
§ time: 시간     
§ size: 인원

In [ ]:
import seaborn as sns
tips = sns.load_dataset("tips")
tips.tail()
#식사 대금 대비 팁의 비율이 어떤 경우에 가장 높아지지는 찾음
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips.tail()
print(tips.describe())

# 성별로 나누어 데이터 갯수를 카운트한다
tips.groupby("sex").count()
tips.groupby("sex").size()
tips.pivot_table("tip_pct", "sex", aggfunc="count", margins=True)

print(tips.pivot_table("tip_pct", "sex", aggfunc="count", margins=True))

       total_bill         tip        size     tip_pct
count  244.000000  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672    0.160803
std      8.902412    1.383638    0.951100    0.061072
min      3.070000    1.000000    1.000000    0.035638
25%     13.347500    2.000000    2.000000    0.129127
50%     17.795000    2.900000    2.000000    0.154770
75%     24.127500    3.562500    3.000000    0.191475
max     50.810000   10.000000    6.000000    0.710345
        tip_pct
sex
Male        157
Female       87
All         244

In [ ]:
#성별과 흡연 여부에 따른 평균 팁 비율
print(tips.groupby("sex")[["tip_pct"]].mean())
print(tips.groupby("smoker")[["tip_pct"]].mean())
tips.pivot_table("tip_pct", "sex")
tips.pivot_table("tip_pct", ["sex", "smoker"])
tips.pivot_table("tip_pct", "sex", "smoker")
tips.groupby("sex")[["tip_pct"]].describe()
tips.groupby("smoker")[["tip_pct"]].describe()
print(tips.groupby(["sex", "smoker"])[["tip_pct"]].describe())

#각 그룹에서 가장 많은 팁과 가장 적은 팁의 차이 계산
def peak_to_peak(x):
  return x.max() - x.min()

print(tips.groupby(["sex", "smoker"])[["tip"]].agg(peak_to_peak))
#여러 그룹연산을 동시 수행하려면 리스트를 이용
print(tips.groupby(["sex", "smoker"]).agg(["mean", peak_to_peak])[["total_bill"]])
#데이터 열마다 다른 연산을 하고 싶다면 열 라벨과 연산 이름(또는 함수)를 딕셔너리로 넣는다.
tips.groupby(["sex", "smoker"]).agg( {'tip_pct': 'mean', 'total_bill': peak_to_peak})
tips.pivot_table(['tip_pct', 'size'], ['sex', 'day'], 'smoker')
tips.pivot_table('size', ['time', 'sex', 'smoker'], 'day', aggfunc='sum', fill_value=0)

         tip_pct
sex
Male    0.157651
Female  0.166491
         tip_pct
smoker
Yes     0.163196
No      0.159328
              tip_pct                      ...
                count      mean       std  ...       50%       75%       max
sex    smoker                              ...
Male   Yes       60.0  0.152771  0.090588  ...  0.141015  0.191697  0.710345
       No        97.0  0.160669  0.041849  ...  0.157604  0.186220  0.291990
Female Yes       33.0  0.182150  0.071595  ...  0.173913  0.198216  0.416667
       No        54.0  0.156921  0.036421  ...  0.149691  0.181630  0.252672

[4 rows x 8 columns]
                tip
sex    smoker
Male   Yes     9.00
       No      7.75
Female Yes     5.50
       No      4.20
              total_bill
                    mean peak_to_peak
sex    smoker
Male   Yes     22.284500        43.56
       No      19.791237        40.82
Female Yes     17.977879        41.23
       No      18.105185        28.58

day                   Thur  Fri  Sat  Sun
time   sex    smoker
Lunch  Male   Yes       23    5    0    0
              No        50    0    0    0
       Female Yes       17    6    0    0
              No        60    3    0    0
Dinner Male   Yes        0   12   71   39
              No         0    4   85  124
       Female Yes        0    8   33   10
              No         2    2   30   43

In [8]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset("titanic")

#(3)
bins = [1, 20, 30, 50, 70, 100] 
labels = ["미성년자", "청년", "중년", "장년", "노년"]
ages = titanic["age"]
cuts = pd.cut(ages,bins, labels=labels)


titanic["category3"] = pd.cut(ages,bins,labels=labels).astype(str)
titanic.head()


df = titanic[['category3']]
df['cnt'] = 1


g = df.groupby('category3')['cnt'].sum()

total = g.sum()
result = g/total
print(result)
print(result.sum())


#(4)
new_age = titanic['age'].mean()
titanic['age'].fillna(new_age, inplace=True)
ages = titanic['age']
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]     #877
titanic['category2'] = pd.cut(ages, bins, labels=labels) 

titanic['gender'] =  titanic.apply(lambda r: '여성' if r.sex == 'female' else '남성', axis=1)
print(titanic.head())


#titanic['category3'] =  titanic.apply(lambda r: titanic['category2'].astype(str)+titanic['gender'].astype(str) if r.age >= 20 else titanic['category2'], axis=1)  
print(titanic.head())

category3
nan     0.214366
노년      0.005612
미성년자    0.185185
장년      0.066218
중년      0.270483
청년      0.258137
Name: cnt, dtype: float64
1.0
   survived  pclass     sex   age  ...  alone  category3  category2 gender
0         0       3    male  22.0  ...  False         청년         청년     남성
1         1       1  female  38.0  ...  False         중년         중년     여성
2         1       3  female  26.0  ...   True         청년         청년     여성
3         1       1  female  35.0  ...  False         중년         중년     여성
4         0       3    male  35.0  ...   True         중년         중년     남성

[5 rows x 18 columns]
   survived  pclass     sex   age  ...  alone  category3  category2 gender
0         0       3    male  22.0  ...  False         청년         청년     남성
1         1       1  female  38.0  ...  False         중년         중년     여성
2         1       3  female  26.0  ...   True         청년         청년     여성
3         1       1  female  35.0  ...  False         중년         중년     여성
4         0       3    male  35.0  ...   True         중년         중년     남성

[5 rows x 18 columns]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:18: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

    
(3) 타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.      
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]     
그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.     
(4) 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라.     
20살 미만이면 성별에 관계없이 “미성년자”라고 한다    
20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

연습문제    
§ 5명의 학생의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.     
(1) 학생 이름을 나타내는 열을 포함시키지 않고 데이터프레임 df_score1 을 생성한 후, df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정한다. reset_index 명령으로 이 인덱스 열을 명령으로 일반 데이터열로 바꾸여 데이터프레임 df_score2을 만든다.    
(2) 학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.

In [ ]:
import pandas as pd
import numpy as np

#(1)
df_score1 = pd.DataFrame(np.arange(15).reshape(5,3),columns=["국어", "영어", "수학"])
index=["학생1", "학생2","학생3", "학생4","학생5"]
df_score1.index=index
print(df_score1)
df_score2 = df_score1.reset_index()
print(df_score2)

#(2)
df3 = df_score2.set_index("index")
print(df3)

     국어  영어  수학
학생1   0   1   2
학생2   3   4   5
학생3   6   7   8
학생4   9  10  11
학생5  12  13  14
  index  국어  영어  수학
0   학생1   0   1   2
1   학생2   3   4   5
2   학생3   6   7   8
3   학생4   9  10  11
4   학생5  12  13  14
       국어  영어  수학
index
학생1     0   1   2
학생2     3   4   5
학생3     6   7   8
학생4     9  10  11
학생5    12  13  14

In [9]:
import csv
f = open('weather.csv')
data = csv.reader(f)
#print(type(data))
header = next(data)
#print(herder)

max_temp = -999  #최고 기온 값을 저장할 변수
max_data = ''  #최고 기온이 가장 높았던 날짜를 저장할 변수

for row in data :
  if row[4] == '':
    row[4] = -999  #-999를 넣어 빈 문자열이 있던 자리라고 표시
  row[4] = float(row[4])   #최고 기온을 실수로 변환
  if max_temp < row[4] :   # 만약 지금까지 최고 기온보다 더 높다면 업데이트
    max_date = row[2]
    max_temp = row[4]
  #print(row)
f.close()
print('기상 관측 이래 서울의 최고 기온이 가장 높았던 날은',max_date+'로,', max_temp,'도 였습니다.')

기상 관측 이래 서울의 최고 기온이 가장 높았던 날은 2018-08로, 33.3 도 였습니다.